#  Задача_1: Сравните  2  числа ,  числа принимаем из консоли
a = int(input("Введите первое число: "))
b = int(input("Введите второе число: "))

if a >  b:
    print(a)
elif  a == b:
    print("Числа  равны")
else:
    print(b)